Revit 2024 API
AlphanumericRevisionSettings Constructor (AlphanumericRevisionSettings)
 Constructs a new copy of the input AlphanumericRevisionSettings object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public AlphanumericRevisionSettings(
	AlphanumericRevisionSettings other
)
Visual Basic
Public Sub New ( _
	other As AlphanumericRevisionSettings _
)
Visual C++
public:
AlphanumericRevisionSettings(
	AlphanumericRevisionSettings^ other
)
Parameters
other
Type: Autodesk.Revit.DB.AlphanumericRevisionSettings
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  other is not a valid AlphanumericRevisionSettings.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
AlphanumericRevisionSettings Class
AlphanumericRevisionSettings Overload
Autodesk.Revit.DB Namespace